Revit 2027 API
ParameterTypeId.SteelElemWeldContinuous Property
 "Continuous"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId SteelElemWeldContinuous { get; }
Public Shared ReadOnly Property SteelElemWeldContinuous As ForgeTypeId
	Get
public:
static property ForgeTypeId^ SteelElemWeldContinuous {
	ForgeTypeId^ get ();
}
static member SteelElemWeldContinuous : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace